Public Member Functions | Public Attributes | List of all members
ACAPI::MEP::RoutingSegmentCircularCrossSectionData Struct Reference
MEP Element Manager
Defines the necessary data for placing CircularRoutingSegments of a RoutingElement. More...
#include <MEPTypes.hpp>
 Public Member Functions
RoutingSegmentCircularCrossSectionData (UInt32 referenceId)
Constructs a RoutingSegmentCircularCrossSectionData.
 Public Attributes
 UInt32  | referenceId
ReferenceId of the cross section.
Detailed Description
Defines the necessary data for placing CircularRoutingSegments of a RoutingElement.
Constructor & Destructor Documentation
◆ RoutingSegmentCircularCrossSectionData()
 ACAPI::MEP::RoutingSegmentCircularCrossSectionData::RoutingSegmentCircularCrossSectionData  |  ( |  UInt32  |  referenceId | )
inline
Constructs a RoutingSegmentCircularCrossSectionData.
Parameters
referenceId | The referenceId of the CircularRoutingSegment.